import random as rnd

m = int(input('Введіть число M (к-ть слів): '))          # Змінні м та n, як і записано в умові
n = int(input('Введіть число N (к-ть літер): '))
абв = "АаБбВвГгҐґДдЕеЄєЖжЗзИиІіЇїЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЬьЮюЯя" # Алфавіт з великими та маленькими літерами

Shortlist =''               # 2 списки для циклу. В 1-ий генерується, в 2-ий додається
list=''

for i in range(m):

    for q in range(n):                  # Цикл в циклі :)
        Shortlist = rnd.choice(абв)
        list = list + Shortlist
    
    list = list + ' '

print(list)


# Заєць Микита, практична №7, вар. 4, задача 2