import v4_PR12_2_Module_generate_text   # Написати програму, яка генеруватиме М рядків довжиною N символів кожен.
                                        # Для  створення  рядка  випадкових  символів  створити  відповідну функцію.
                                        # Алфавіт повинен передаватися у функцію у вигляді параметра.


m = int(input("Введіть к-ть рядків зі словами: "))                                  # Змінні
n = int(input("Введіть довжину слів: "))
digits = "АаБбВвГгҐґДдЕеЄєЖжЗзИиІіЇїЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЬьЮюЯя"       # Знаки для випадкової генерації

arr = v4_PR12_2_Module_generate_text.phone_num_generator(m, n, digits)              # Виклик функції із іншого файла, яка павинна повертати масив значень

for i in range(m):                                                                  # Виводимо по рядках
    print(arr[i])


#Практична робота 12, 2 задача, варіант 4, Заєць Микита, 16 група