import math as m
                                        #Практична робота 5, варіант 4, Заєць Микита
x = float(input("Введіть x: ")) #

if x>=0 :   #Перевірка x
    y = x + m.pow(2,x-4) - m.sqrt(x)    #Математична формула, за якою рахується ф-ія

elif x>-7.7 and x<0 :   #Інша перевірка х
    y = m.sin(2*x) + m.log10(m.fabs(x)) #Ще одна математична формула, за якою рахується ф-ія

else :  #Якщо у 2 минулих перевірках ми нічого не отримали, будеввиконуватися ці ф-ія
    y = m.cos(3*x)-1/x  #Остання формула

print("f(x) = ",y)  #Вивід ф-ії