import json         # Текстовий  файл  містить  дані  про  ціну  1  г  цінних  металів  (у  форматі JSON).
import os           # Програма повинна обчислити вартість ювелірного виробу.
                    # Назву металу і масу виробу задає користувач.


os.chdir(r"F:\University\Python\PR_11")     # Відкриваю папку з проєктом та файлами


with open('Metals.json') as JSON_file:      # Відкриваю JSON файл

    data = dict(json.load(JSON_file))                                       # Змінна - словник із данними із JSON файлу
    mass = float(input("Введіть к-ть грамів вашого майбутнього ювелірного виробу: "))

    print("Можливі метали для вашого виробу: ")
    for key in data:                                                        # Виводимо всі доступні метали
        print (key)
    metall = str(input("Введіть назву металу зі списку, з якого хочете ювелірний виріб: "))
    price = float(data[metall])                                             # отримуємо ціну за введеним раніше металом

    print("Ви вибрали, що хочете виріб із", metall,"вагою ",mass,"гр",", який буде вам коштувати ",round(price*mass,2),"грн")


#Практична робота 11, 2 задача, варіант 4, Заєць Микита, 16 група
