import math as m
                                                            #Практична робота 5, 2 задача, варіант 4, Заєць Микита
R = int(input("Введіть радіус зовнішнього кола: ")) #Вводимо ручні змінні
r = int(input("Введіть внутрішній радіус кола: "))

x = float(input("Введіть X координату вашої точки: "))
y = float(input("Введіть Y координату вашої точки: "))

if m.fabs(x)>R or m.fabs(x)<r or m.fabs(y)>R or m.fabs(y)<r: #Перевірка координат на НЕ належніть кільцю через їх модуль

    print("Точка не належить кільцю")

else :
    print("Точка належить кільцю, чудово")