import v4_PR12_1_Module_generate_phone_num  # Написати функцію, яка буде виводити на екран N телефонних номерів одного з мобільних операторів України
                                            # Формат номера: код оператора (099) 1234567 (випадкове семизначне число). 


n = int(input("Введіть цільову кількість номерів для генерації: "))             # Змінна, яка запам'ятовує цільову кількість номерів

phone_numbers_list = v4_PR12_1_Module_generate_phone_num.phone_num_generator(n)    # Змінна, яка дорівнює викликаній функції в іншому файлі (список)
print(phone_numbers_list)                                                          # Виводимо список


#Практична робота 12, 1 задача, варіант 4, Заєць Микита, 16 група