import csv          # Написати програму, яка зчитує з CSV файла словник з даними  про обсяг продаж фірми за місяцями
import os           # і виводить на екран ці дані у вигляді таблиці,
                    # а також підраховує сумарний і середній обсяг продаж.


os.chdir(r"F:\University\Python\PR_11")     # Відкриваю папку з проєктом та файлами


with open('Data.csv') as csvfile:           # Відкриваю CSV файл

    counter = 0                             # Змінні для майбутніх розрахунків
    sum = 0.0
    file_reader = csv.reader(csvfile, delimiter = ";")  # Змінна (словник) отримує значення із CSV файлу, де записи розділені символом ";"

    for row in file_reader:                 # Цикл, який:
        counter+=1                          # Рахує кількість рядків
        sum+=int(row[1])                    # Рахує суму
        print(row[0], " - ",row[1],"грн")   # Виводить словник у вигляді "таблиці"?

print("Всього отримано за рік: ", sum,"грн")            # Виводимо сумарний обсяг продаж
print("В середньому за місяць: ", sum/counter, "грн")   # Виводимо середній обсяг продаж


#Практична робота 11, 1 задача, варіант 4, Заєць Микита, 16 група