from ast import Break
import math as m

#Практична робота 6, 2 задача, варіант 4, Заєць Микита, 16 група

l = float(input("Введіть ліву межу ф-ії: "))
r = float(input("Введіть праву межу ф-ії: "))
n = float(input("Введіть крок для x: "))    #Вводимо змінні

x = float(l)    # х, тобто змінна, починається з лівої межі
y = 0.0
i = 1

while x<r:  #Цикл з післяумовою
    y = 7 - x*m.pow(m.e,2*x-1) + m.sqrt(m.fabs(x))
    y = round(y,1)                                  #Округлення до 1 числа після крапки
    print("Число №", i," = ", y)
    x = x+n
    i = i+1